const modelTimesRUSSIA = {
    Мужчина: {
        "1х": 397, // Одиночка надо менять
        "1х л/в": 412, // Одиночка легкий вес
        "2-": 377, // Двойка без рулевого
        "2- л/в": 390, // Двойка без рулевого легкий вес
        "2х": 366, // Двойка парная
        "2х л/в": 373, // Двойка парная легкий вес
        "4-": 346, // Четверка без рулевого
        "4х": 335, // Четверка парная
        "4х л/в": 344, // Четверка парная легкий вес
        "4+": 358, // Четверка с рулевым
        "8+": 322, // Восьмерка с рулевым
    },
    Женщины: {
        "1х": 435,
        "1х л/в": 452,
        "2-": 418,
        "2- л/в": 434,
        "2х": 412,
        "2х л/в": 412,
        "4-": 384,
        "4х": 369,
        "4х л/в": 392,
        "4+": 418,
        "8+": 359,
    },
    "Юниоры до 23": {
        "1х": 404,
        "1х л/в": 419,
        "2-": 384,
        "2- л/в": 397,
        "2х": 374,
        "2х л/в": 383,
        "4-": 354,
        "4х": 342,
        "4х л/в": 351,
        "4+": 364,
        "8+": 329,
    },
    "Юниорки до 23": {
        "1х": 443,
        "1х л/в": 459,
        "2-": 425,
        "2- л/в": 434,
        "2х": 410,
        "2х л/в": 419,
        "4-": 391,
        "4х": 376,
        "4х л/в": 392,
        "4+": 425,
        "8+": 366,
    },
    "Юноши до 19": {
        "1х": 421,
        "2-": 402,
        "2х": 386,
        "4-": 366,
        "4х": 355,
        "4+": 375,
        "8+": 340,
    },
    "Девушки до 19": {
        "1х": 461,
        "2-": 446,
        "2х": 424,
        "4-": 404,
        "4х": 389,
        "8+": 376,
    },
    "Юноши до 17": {
        "1х": 434,
        "2-": 414,
        "2х": 397,
        "4-": 377,
        "4х": 366,
    },
    "Девушки до 17": {
        "1х": 475,
        "2-": 459,
        "2х": 437,
        "4-": 416,
        "4х": 401,
    },
    "Юноши до 15": {
        "1х": 446,
        "2-": 430,
        "2х": 418,
        "4-": 396,
        "4х": 384,
    },
    "Девушки до 15": {
        "1х": 494,
        "2-": 484,
        "2х": 474,
        "4-": 442,
        "4х": 434,
    },
}

function getModelTime(ageCategory, distance, boatClass, actualTime) {
    const categoryMap = {
        "Юноши до 19": "Юноши до 19",
        "Девушки до 19": "Девушки до 19",
        "Юниоры до 23": "Юниоры до 23",
        "Юниорки до 23": "Юниорки до 23",
        "Юноши до 17": "Юноши до 17",
        "Девушки до 17": "Девушки до 17",
        "Юноши до 15": "Юноши до 15",
        "Девушки до 15": "Девушки до 15",
        Мужчина: "Мужчина",
        Женщины: "Женщины",
    }

    const modelCategory = categoryMap[ageCategory]
    if (
        !modelCategory ||
        !modelTimesRUSSIA[modelCategory] ||
        !modelTimesRUSSIA[modelCategory][boatClass]
    ) {
        throw new Error("Invalid category or boat class")
    }

    const baseModelTime = modelTimesRUSSIA[modelCategory][boatClass]
    const modelTime = baseModelTime * (distance / 2000)

    return modelTime
}

module.exports = {
    getModelTime,
    modelTimesRUSSIA,
}
