export const modelTimesWORLD = {
    Мужчина: {
        "1х": 390.74, // Одиночка
        "1х л/в": 401.03, // Одиночка легкий вес
        "2-": 368.5, // Двойка без рулевого
        "2- л/в": 382.91, // Двойка без рулевого легкий вес
        "2х": 359.72, // Двойка парная
        "2х л/в": 365.33, // Двойка парная легкий вес
        "4-": 337.86, // Четверка без рулевого
        "4х": 332.03, // Четверка парная
        "4х л/в": 342.75, // Четверка парная легкий вес
        "4+": 358.96, // Четверка с рулевым
        "8+": 318.68, // Восьмерка с рулевым
    },
    Женщины: {
        "1х": 427.71,
        "1х л/в": 443.36,
        "2-": 407.41,
        "2- л/в": 438.32,
        "2х": 397.31,
        "2х л/в": 401.0,
        "4-": 374.36,
        "4х": 365.13,
        "4х л/в": 375.95,
        "4+": 403.86,
        "8+": 352.99,
    },
    "Юниоры до 23": {
        "1х": 402.97,
        "1х л/в": 406.34,
        "2-": 379.99,
        "2- л/в": 386.47,
        "2х": 367.57,
        "2х л/в": 373.62,
        "4-": 344.38,
        "4х": 339.62,
        "4х л/в": 345.42,
        "4+": 363.01,
        "8+": 322.48,
    },
    "Юниорки до 23": {
        "1х": 444.89,
        "1х л/в": 444.59,
        "2-": 418.41,
        "2- л/в": 450.98,
        "2х": 407.03,
        "2х л/в": 414.41,
        "4-": 386.6,
        "4х": 378.3,
        "4х л/в": 385.96,
        "4+": 422.22,
        "8+": 360.13,
    },
    "Юноши до 19": {
        "1х": 405.45,
        "2-": 387.91,
        "2х": 378.19,
        "4-": 347.73,
        "4х": 346.49,
        "4+": 371.96,
        "8+": 333.43,
    },
    "Девушки до 19": {
        "1х": 451.5,
        "2-": 435.53,
        "2х": 417.4,
        "4-": 392.76,
        "4х": 383.85,
        "4+": 412.84,
        "8+": 372.16,
    },
}

export function getModelTime(ageCategory, distance, boatClass, actualTime) {
    const categoryMap = {
        "Юноши до 19": "Юноши до 19",
        "Девушки до 19": "Девушки до 19",
        "Юниоры до 23": "Юниоры до 23",
        "Юниорки до 23": "Юниорки до 23",
        Мужчина: "Мужчина",
        Женщины: "Женщины",
    }

    const modelCategory = categoryMap[ageCategory]
    if (
        !modelCategory ||
        !modelTimesWORLD[modelCategory] ||
        !modelTimesWORLD[modelCategory][boatClass]
    ) {
        throw new Error("Invalid category or boat class")
    }

    const baseModelTime = modelTimesWORLD[modelCategory][boatClass]

    // Recalculate model time based on average speed
    const modelSpeed = 2000 / baseModelTime;
    const modelTime = distance / modelSpeed;

    return modelTime
}

